Autodesk.Revit.DB.PolymeshFacet.ToString
Returns formatted string showing (V1, V2, V3) with values formatted as regular integers

Autodesk.Revit.DB.PolymeshFacet.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
This property is always True for a polymesh facet.
Returns:
True if the API object holds a valid Revit native object, false otherwise.

Autodesk.Revit.DB.PolymeshFacet.GetVertices
Returns the three vertices that define this facet
Remarks:
A container with three integers (indices of the vertices) is returned.

Autodesk.Revit.DB.PolymeshFacet.V3
The third vertex of the facet
An index of a vertex of a polymesh.

Autodesk.Revit.DB.PolymeshFacet.V2
The second vertex of the facet
An index of a vertex of a polymesh.

Autodesk.Revit.DB.PolymeshFacet.V1
The first vertex of the facet
An index of a vertex of a polymesh.

Autodesk.Revit.DB.PolymeshFacet.#ctor(System.Int32,System.Int32,System.Int32)
Creates a PolymeshFacet with the supplied vertices.
v1: The first vertex.
v2: The second vertex.
v3: The third vertex.
Since:
2019.2

Autodesk.Revit.DB.PolymeshFacet
A class representing one triangular piece - a facet - in a polymesh topology.
Remarks:
It can also be used to create TopographySurface.
Each facet is defined by indices of three vertices of the polymesh.
Since:
2014